{
    "version": "https://jsonfeed.org/version/1",
    "title": "brainCloud docs Blog",
    "home_page_url": "https://getbraincloud.github.io/braincloud-apiref/blog",
    "description": "brainCloud docs Blog",
    "items": [
        {
            "id": "migrating-from-gamesparks",
            "content_html": "<p>Hey, folks,</p><p>As you may have seen in the trades, Amazon has recently announced the imminent deprecation of GameSparks to their current customers and partners.</p><p>We really like the tech and people at GameSparks and are sorry to see it go (really!). That said, we want to assure all GameSparks customers and partners that brainCloud can offer all developers (from hobbyists, startups, and big studios alike) an alternative to ensure efficient and full migration to prevent downtime for their players.</p><p>As most of you know, we launched brainCloud in 2014 and have been supporting all kinds of indies and big studios since then. We’ve also recently been working as a solution integrator in collaboration with Amazon Game Tech to assist GameSparks deprecation efforts and existing GameSparks customer migration.</p><p>brainCloud has a robust, comparable feature set that includes popular GameSparks features like Player and Game Management, Cloud Scripts, Leaderboards, Achievements, Messaging, Virtual Goods &amp; Currencies, and Real-time features like Lobbies, Matchmaking, Notifications, and Chat.</p><p>That said, brainCloud also has advanced features not implemented in GameSparks like Custom Room &amp; Relay Servers for real-time multiplayer, Tournaments, Blockchain Integration, Segments, Profanity Filters, Pricing and Promotion features, Playback Streams and connectivity to virtually any data collection or storage application through our Datastream service.</p><p>And of course, brainCloud supports all popular mobile and console platforms, including built-in Oculus support. We even have APIs to help migrate your users over to our back-end. And of particular interest to ex-GameSparks folks, we are happy to announce that Amazon GameLift integration will be added to brainCloud this fall!</p><p>All of this is available via a variety of licensing options that range from monthly BaaS subscriptions all the way up to private and platform licensing. All with world-class support and available professional services.</p><p>We encourage all existing GameSparks customers to check out brainCloud and let us know how we can help you migrate and grow your games on all platforms. We are here to help. Just sign up – brainCloud is free during development!</p><p>Happy Coding,</p><p>Paul from brainCloud.</p><p>( PS – For more information, check out our <a href=\"https://help.getbraincloud.com/en/articles/5441729-gamesparks-migration-faq\" target=\"_blank\" rel=\"noopener noreferrer\">GameSparks Migration FAQ</a>. )</p>",
            "url": "https://getbraincloud.github.io/braincloud-apiref/blog/migrating-from-gamesparks",
            "title": "Migrating From Gamesparks",
            "summary": "Hey, folks,",
            "date_modified": "2021-07-22T00:00:00.000Z",
            "author": {
                "name": "Paul Winterhalder",
                "url": "https://github.com/winterhalder"
            },
            "tags": [
                "Amazon",
                "GameSparks"
            ]
        },
        {
            "id": "apple-facebook-privacy-post",
            "content_html": "<p>Apple is introducing comprehensive changes to iOS 14.5, iPadOS 14.5 and tvOS 14.5 that will require apps to ask users for their permission to track them across apps and websites owned by other companies.</p><p>At first glance, this seems like something that would mostly affect apps that are using user data for advertising-based monetization — but in truth, the implications are deeper than that.</p><p>For the record, we at brainCloud very much appreciate and advocate for user privacy. All user data associated with a brainCloud app is private to that app — the data is not aggregated or shared across apps or companies in any way. So if your app is using brainCloud without 3rd party authentication, you can feel confident that that data is not being shared in any way.</p><p>That said, brainCloud does support authentication-based integrations with third party providers — most importantly Facebook.</p><p>The Frequently Asked Questions from the Apple page linked above clarify their guidance in this area:</p><p><img loading=\"lazy\" alt=\"apple privacy\" src=\"/braincloud-apiref/assets/images/1_XbJCJVzTBMjkaDlcmmmmgQ-8b9424a79f40a672acb18419b183fc86.png\" width=\"878\" height=\"1132\" class=\"img_ev3q\"></p><p>By this interpretation, just offering a classic Facebook Account login for your app — which is prety standard practice — requires you to get the user’s permission for tracking across apps and websites owned by other companies. The rationale is that your app may not be sharing the data — but Facebook itself certainly is.</p><p>Aside from Facebook’s objections to these changes (we don’t want to get into that) — Facebook has offered a recommended technical solution — they have extended their Facebook Login feature to include a new Limited Login Mode.</p><p><img loading=\"lazy\" alt=\"facebook limited login\" src=\"/braincloud-apiref/assets/images/1_GcvS9VJr6EwWPf09xxP27w-554823f56c749f63285ccdc72bbe99ac.png\" width=\"1600\" height=\"1114\" class=\"img_ev3q\"></p><p>So — Limited Login mode seems like a pretty good solution to this problem. There is a pretty big limitation here though. If users opt for the Limited Login mode, the app will not have access to the Graph API.</p><p>For games and social apps — this is a pretty big limitation. It means that the app (and backend services like brainCloud that act on it’s behalf) will lose the ability to query Facebook for the user’s friends. This will have a huge impact on games that depend upon those sorts of social interactions for engagement and monetization.</p><p>It is therefore highly recommended that games pop-up their own informational message before Apple’s built-in pop-up, to educate the user on any features that may become unavailable as a consequence of their choice.</p><p>Another issue is that the identification information returned from the new Limited Login mode is different than with the Classic Login. This means that backend services, like brainCloud, need to implement changes to work with this new mode. The silver lining is that the underlying id of the user remains the same between the two modes — so a user who flips back and forth between the two modes can still be associated with the same back-end account — phew!</p><p>We at brainCloud are working hard to incorporate the necessary changes — and will be releasing brainCloud 4.7 with Facebook Limited Login mode before the end of March 2021.</p><p>A few more details about the changes in brainCloud 4.7:</p><ul><li>Full Support for Facebook Limited Login mode across the authentication + identity APIs. The same user using either mode will be linked to the same underlying brainCloud profile.</li><li>brainCloud will automatically handle the loss of the Graph API for Limited Login mode users — so for example, users will simply appear to have no Facebook friends (instead of the client app having to deal with errors).</li><li>Coincidentally, brainCloud 4.7 will include new support for Steam and Playstation Network friends — so apps can extend their friend support in other areas.</li><li>brainCloud already supports self-managed Friend APIs. See AddFriends(), ListFriends(), etc.</li></ul><p>We hope that this helps to clarify the impact of these changs to iOS 14.5, and how brainCloud can help your apps to adapt.</p>",
            "url": "https://getbraincloud.github.io/braincloud-apiref/blog/apple-facebook-privacy-post",
            "title": "Apple iOS 14.5 Privacy & Facebook Limited Login mode",
            "summary": "Apple is introducing comprehensive changes to iOS 14.5, iPadOS 14.5 and tvOS 14.5 that will require apps to ask users for their permission to track them across apps and websites owned by other companies.",
            "date_modified": "2021-03-11T00:00:00.000Z",
            "author": {
                "name": "Paul Winterhalder",
                "url": "https://github.com/winterhalder"
            },
            "tags": [
                "bitheads",
                "braincloud",
                "apple",
                "facebook",
                "pravicy"
            ]
        }
    ]
}